Revit 2027 API
ConnectorSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ConnectorSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As ConnectorSetIterator
public:
virtual ConnectorSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ConnectorSetIterator
override ForwardIterator : unit -> ConnectorSetIterator
Return Value
ConnectorSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
ConnectorSet Class
Autodesk.Revit.DB Namespace